starter-kit-registers.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Starter Kit Registers</title>
<!-- 2014-10-13 Mon 22:00 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
</head>
<body>
<div id="content">
<h1 class="title">Starter Kit Registers</h1>
<p>
This is part of the <a href="starter-kit.html">Emacs Starter Kit</a>.
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Starter Kit Registers</h2>
<div class="outline-text-2" id="text-1">
<p>
Registers allow you to jump to a file or other location quickly. Use
<code>C-x r j</code> followed by the letter of the register (i for <code>init.el</code>, r
for this file) to jump to it.
</p>

<p>
You should add registers here for the files you edit most often.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp" id="starter-kit-registers">(<span style="font-weight: bold;">dolist</span>
    (r `((?i (file . ,(concat starter-kit-dir <span style="font-style: italic;">"init.el"</span>)))
         (?I (file . ,(<span style="font-weight: bold;">let*</span> ((user user-login-name)
                             (org (expand-file-name (concat user <span style="font-style: italic;">".org"</span>) starter-kit-dir))
                             (el  (expand-file-name (concat user <span style="font-style: italic;">".el"</span>) starter-kit-dir))
                             (dir (expand-file-name user starter-kit-dir)))
                        (<span style="font-weight: bold;">cond</span>
                         ((file-exists-p org) org)
                         ((file-exists-p el)  el)
                         (t dir)))))
         (?s (file . ,(concat starter-kit-dir <span style="font-style: italic;">"starter-kit.org"</span>)))
         (?r (file . ,(concat starter-kit-dir <span style="font-style: italic;">"starter-kit-registers.org"</span>)))))
  (set-register (car r) (cadr r)))
</pre>
</div>
</div>
</div>
</div>
</body>
</html>
